[
  {
    "@context": "https://schema.org/",
    "@type": "JobPosting",
    "title": "Corporate Broker (Licensed Customs Broker)Department · St.George UT · Full-time",
    "description": "Corporate Broker (Licensed Customs Broker)Department · St.George UT · Full-time",
    "datePosted": "2026-02-12",
    "hiringOrganization": {
      "@type": "Organization",
      "name": "Zonos",
      "sameAs": "https://zonos.com"
    },
    "jobLocation": {
      "@type": "Place",
      "address": {
        "@type": "PostalAddress",
        "addressLocality": "Remote"
      }
    },
    "url": "https://jobs.deel.com/job-boards/zonos",
    "employmentType": "DEPARTMENT_·_ST.GEORGE_UT_·_FULL_TIME"
  },
  {
    "@context": "https://schema.org/",
    "@type": "JobPosting",
    "title": "Corporate Broker (Licensed Customs Broker)Department · St.George UT · Full-time",
    "description": "Corporate Broker (Licensed Customs Broker) @ Zonos | Deel - Your forever people platform\n\nAt Zonos we provide scalable technology to simplify the complexities of international commerce, making it accessible to everyone. We create products that allow businesses to take complete control of their cross-border trade experience. Our SaaS solutions alleviate the headaches of cross-border trade with APIs and software that provide businesses with the tools and data they need to scale globally, including the only true landed cost solution on the market. If you're looking to join a company with a strong mission and vision that puts people first, we want to meet you.\n\nWe're looking for a Licensed Customs Broker to establish the compliance framework for a high-growth technology company reshaping how e-commerce and international trade work.\n\nRecently selected for CBP's Commercial Solutions Opening Pilot (CSOP) program and recognized as a CBP Qualified Party for AI-driven trade compliance solutions, Zonos is working directly with CBP on next-generation customs solutions. You'll be building compliant processes at the intersection of cutting-edge technology and regulatory requirements, architecting how compliance works when automation handles the heavy lifting.\n\nEstablish and maintain compliant processes for customs business activities within Zonos\n\nProvide oversight and sign-off on classification guidance, duty calculations, and CBP interactions\n\nBuild internal procedures that bridge our technology with regulatory requirements, ensuring Zonos operations meet all customs broker obligations\n\nWork with modern technology and automated workflows, translating regulatory requirements into practical, scalable operations\n\nBuild compliant systems at scale where millions of shipments depend on getting customs right\n\nYou'll be working with a team that's building the future of cross-border commerce, working directly with CBP on innovative pilot programs, and establishing how compliance works when technology does the heavy lifting. This is officer-level work: building systems, making strategic decisions, and representing Zonos's compliance posture to regulators and partners.\n\nThat's the baseline. But we're looking for more than credentials.\n\nSomeone who understands e-commerce customs operations.\n\nYou've dealt with the incomplete data, the misclassifications from sellers who don't understand what they're shipping, and all the chaos of moving goods across borders at scale.\n\nYou can translate regulatory requirements into systems that work in practice.\n\nYou think about how processes will scale, where they'll break, and how to build in quality from the start.\n\nYou've worked effectively with CBP and understand that compliance is a partnership.\n\nExperience with PGA permits, certifications, and compliance procedures\n\nAbility to work effectively with both CBP and PGA officials\n\nExperience with brokerage software platforms (CargoWise, Descartes, WiseTech, Customs City)\n\nActual salaries will vary based on various factors such as education, experience, training, scope, etc. Salary is just one component of our total compensation package.\n\nMedical, Dental, Vision, & Life - we pay 100% of the employee premium!\n\nFlexible time off - we require all our Zonuts to take a minimum of 2 weeks off per year. Take some time to relax!\n\nOffice stocked with snacks and drinks + weekly team lunch\n\nWelcome to Southern Utah where the sun is shining 255 days out of the year, palm trees are swaying in the breeze, and adventure and exploration await! Neighboring the stunning Zion National Park, Southern Utah is known for its outdoor recreation. Explore endless options for biking and hiking trails all over town, enjoy watersports, boating, and fishing at Sand Hollow State Park, and when you need to get away, we are only a short hour and a half drive to the entertainment and fun of Las Vegas.\n\nAs a Zonut you'll be able to take in the gorgeous view of St. George from Tech Ridge, a rapidly growing epicenter for tech, retail, and dining here in Southern Utah. As an organization, we are always striving to be a great company, not just a big company. We are constantly cultivating an environment of collaboration and teamwork, where our APIs and core values are the living, breathing heartbeat of everything we do.\n\nPlease upload your resume (preferably as a PDF file) *\n\nIf you are not already local to the area, are you willing to relocate to St George? *\n\nAre you legally authorized to work in the US without visa sponsorship? *\n\nand acknowledge that my personal data will be processed as part of this application.",
    "datePosted": "2026-02-12",
    "hiringOrganization": {
      "@type": "Organization",
      "name": "Zonos",
      "sameAs": "https://zonos.com"
    },
    "jobLocation": {
      "@type": "Place",
      "address": {
        "@type": "PostalAddress",
        "addressLocality": "Remote"
      }
    },
    "url": "https://jobs.deel.com/job-boards/zonos/job-details/815a46a0-a70f-4842-8ffe-b4c6f8e07802",
    "employmentType": "DEPARTMENT_·_ST.GEORGE_UT_·_FULL_TIME"
  },
  {
    "@context": "https://schema.org/",
    "@type": "JobPosting",
    "title": "Corporate Broker (Licensed Customs Broker)Department · St.George UT · Full-time",
    "description": "Corporate Broker (Licensed Customs Broker)Department · St.George UT · Full-time",
    "datePosted": "2026-02-12",
    "hiringOrganization": {
      "@type": "Organization",
      "name": "Zonos",
      "sameAs": "https://zonos.com"
    },
    "jobLocation": {
      "@type": "Place",
      "address": {
        "@type": "PostalAddress",
        "addressLocality": "Remote"
      }
    },
    "url": "https://jobs.deel.com/job-boards/zonos",
    "employmentType": "DEPARTMENT_·_ST.GEORGE_UT_·_FULL_TIME"
  }
]