[
  {
    "title": "Corporate Broker (Licensed Customs Broker)Revenue - Department · St.George UT · Full-time",
    "url": "https://jobs.deel.com/job-boards/zonos",
    "location": "Remote",
    "job_type": "Revenue - Department · St.George UT · Full-time",
    "company": "Zonos",
    "date_posted": "2026-02-22",
    "description": "Corporate Broker (Licensed Customs Broker)Revenue - Department · St.George UT · Full-time"
  },
  {
    "title": "DevOps EngineerEngineering - Department · St.George UT · Full-time",
    "url": "https://jobs.deel.com/job-boards/zonos/job-details/73af1f0e-6b33-41e4-99f4-3cf1178e9f00",
    "location": "Remote",
    "job_type": "Engineering - Department · St.George UT · Full-time",
    "company": "Zonos",
    "date_posted": "2026-02-22",
    "description": "<h3>What We Offer</h3>\n<ul>\n<li>Salaries will vary based on various factors such as education, experience, training, scope, etc.</li>\n<li>Medical, Dental, Vision, & Life - we pay 100% of the employee premium!</li>\n<li>Paid leave for maternity, paternity, and other life events</li>\n<li>Employee Assistance Program</li>\n<li>401k retirement plan with generous company match</li>\n<li>Flexible time off - we require all our Zonuts to take a minimum of 2 weeks off per year. Take some time to relax!</li>\n<li>1 month paid time off at 5 year anniversary</li>\n<li>Weekly company lunch</li>\n</ul>"
  },
  {
    "title": "Corporate Broker (Licensed Customs Broker)Revenue - Department · St.George UT · Full-time",
    "url": "https://jobs.deel.com/job-boards/zonos",
    "location": "Remote",
    "job_type": "Revenue - Department · St.George UT · Full-time",
    "company": "Zonos",
    "date_posted": "2026-02-22",
    "description": "Corporate Broker (Licensed Customs Broker)Revenue - Department · St.George UT · Full-time"
  },
  {
    "title": "DevOps EngineerEngineering - Department · St.George UT · Full-time",
    "url": "https://jobs.deel.com/job-boards/zonos",
    "location": "Remote",
    "job_type": "Engineering - Department · St.George UT · Full-time",
    "company": "Zonos",
    "date_posted": "2026-02-22",
    "description": "DevOps EngineerEngineering - Department · St.George UT · Full-time"
  },
  {
    "title": "Corporate Broker (Licensed Customs Broker)Revenue - Department · St.George UT · Full-time",
    "url": "https://jobs.deel.com/job-boards/zonos/job-details/815a46a0-a70f-4842-8ffe-b4c6f8e07802",
    "location": "Remote",
    "job_type": "Revenue - Department · St.George UT · Full-time",
    "company": "Zonos",
    "date_posted": "2026-02-22",
    "description": "<p>At Zonos we provide scalable technology to simplify the complexities of international commerce, making it accessible to everyone. We create products that allow businesses to take complete control of their cross-border trade experience.</p>\n<p>Our SaaS solutions alleviate the headaches of cross-border trade with APIs and software that provide businesses with the tools and data they need to scale globally, including the only true landed cost solution on the market. If you're looking to join a company with a strong mission and vision that puts people first, we want to meet you.</p>\n<p>This position is based in St. George, Utah. Relocation assistance is provided.</p>\n<h3>About the Role</h3>\n<p>We're looking for a Licensed Customs Broker to establish the compliance framework for a high-growth technology company reshaping how e-commerce and international trade work.\nRecently selected for CBP's Commercial Solutions Opening Pilot (CSOP) program and recognized as a CBP Qualified Party for AI-driven trade compliance solutions, Zonos is working directly with CBP on next-generation customs solutions. You'll be building compliant processes at the intersection of cutting-edge technology and regulatory requirements, architecting how compliance works when automation handles the heavy lifting.</p>\n<h3>What You'll Work On</h3>\n<ul>\n<li>Establish and maintain compliant processes for customs business activities within Zonos</li>\n<li>Provide oversight and sign-off on classification guidance, duty calculations, and CBP interactions</li>\n<li>Build internal procedures that bridge our technology with regulatory requirements, ensuring Zonos operations meet all customs broker obligations</li>\n<li>Work with modern technology and automated workflows, translating regulatory requirements into practical, scalable operations</li>\n<li>Build compliant systems at scale where millions of shipments depend on getting customs right</li>\n</ul>\n<h3>Why This Role is Different</h3>\n<p>You'll be working with a team that's building the future of cross-border commerce, working directly with CBP on innovative pilot programs, and establishing how compliance works when technology does the heavy lifting. This is officer-level work: building systems, making strategic decisions, and representing Zonos's compliance posture to regulators and partners.</p>\n<h3>What We're Looking For</h3>\n<p>You must have an active US Customs Broker License. That's the baseline. But we're looking for more than credentials. Someone who understands e-commerce customs operations. You've dealt with the incomplete data, the misclassifications from sellers who don't understand what they're shipping, and all the chaos of moving goods across borders at scale. You've established compliant processes before. You're comfortable in a fast-paced technology environment where figuring out how regulations apply to new business models takes thought and good judgment. You can translate regulatory requirements into systems that work in practice. You think about how processes will scale, where they'll break, and how to build in quality from the start. You've worked effectively with CBP and understand that compliance is a partnership.</p>\n<h3>Required</h3>\n<ul>\n<li>Active US Customs Broker License</li>\n<li>3+ years of customs brokerage experience</li>\n<li>Strong understanding of PGA requirements</li>\n<li>Experience with PGA permits, certifications, and compliance procedures</li>\n<li>Ability to work effectively with both CBP and PGA officials</li>\n</ul>\n<h3>What We Offer</h3>\n<ul>\n<li>Actual salaries will vary based on various factors such as education, experience, training, scope, etc. Salary is just one component of our total compensation package.</li>\n<li>Medical, Dental, Vision, & Life - we pay 100% of the employee premium!</li>\n<li>Paid parental leave and other life event leave</li>\n<li>401k retirement plan with generous company match</li>\n<li>Flexible time off - we require all our Zonuts to take a minimum of 2 weeks off per year. Take some time to relax!</li>\n<li>Employee Assistance Program</li>\n<li>1 month paid time off at 5 year anniversary</li>\n<li>Office stocked with snacks and drinks</li>\n<li>Weekly company lunches</li>\n</ul>"
  },
  {
    "title": "DevOps EngineerEngineering - Department · St.George UT · Full-time",
    "url": "https://jobs.deel.com/job-boards/zonos",
    "location": "Remote",
    "job_type": "Engineering - Department · St.George UT · Full-time",
    "company": "Zonos",
    "date_posted": "2026-02-22",
    "description": "DevOps EngineerEngineering - Department · St.George UT · Full-time"
  }
]